# MEPAnalytical Segment Get Loss Coefficient Override Method

Source: https://www.revitapidocs.com/2026/3d33e585-d8f7-a80f-509b-6bce55962dd0.htm

---

| MEPAnalytical Segment Get Loss Coefficient Override Method |
| --- |

Gets the overridden value of loss coefficient, dimensionless.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetLossCoefficientOverride()
```

```
Public Function GetLossCoefficientOverride As Double
```

```
public:
double GetLossCoefficientOverride()
```

```
member GetLossCoefficientOverride : unit -> float
```

#### Return Value

Double
The overridden value, or 0\.0 if the loss efficient is not overridden. See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace